Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Multiple dispatch together with the flexible parametric type system give Julia its ability to abstractly express high-level algorithms decoupled from implementation details, yet generate efficient, specialized code to handle each case at run time.
ja: 多重ディスパッチと柔軟なパラメトリック型システムによって、Juliaに与えられた能力は、高水準のアルゴリズムを抽象的に表現して、実装の詳細から切り離し、実行時に各ケースに特化して処理する効率的なコードを生成することです。

source: Multiple nested for loops can be combined into a single outer loop, forming the cartesian product of its iterables:
ja: ネストしたforループ内のbreak文は、内側のループだけでなく、ネスト全体のループを終了します。

source: Multiple parameters can be separated with commas, e.g. where {T, S<:Real}, or written using nested where, e.g. where S<:Real where T.
ja: 複数のパラメータは、例えば、カンマで区切ったり(例where {T, S<:Real})、またはネストされたwhereを使ったりして記述されます。（例where S<:Real where T）

source: Multiplication
ja: 乗算

source: NaN is not equal to, not less than, and not greater than anything, including itself.
ja: NaNは、それ自体を含めて、以下ではなく、それ以上ではありません。

source: Name
ja: 名前

source: Names of Types and Modules begin with a capital letter and word separation is shown with upper camel case instead of underscores.
ja: 型>と モジュールの名前は大文字で始まり、単語の区切りはアンダースコアの代わりにキャメルケースで表記されます。

source: Names of functions and macros are in lower case, without underscores.
ja: 関数や マクロの名前はアンダースコアを含まない小文字で表記されます。

source: Names of variables are in lower case.
ja: 変数名を小文字で表記する。

source: Naturally, it is possible for quote expressions to contain other quote expressions.
ja: 当然ながら、quote式には他の引用符式を含めることもできます。

source: Neither juxtaposition of two parenthesized expressions, nor placing a variable before a parenthesized expression, however, can be used to imply multiplication:
ja: 括弧で括られた2つの表現の並列化はなく、括弧で括られたものの前に変数を配置することもない しかし、表現は乗算を意味するために使用することができます。

source: Nested "dot calls" f.(...) (including calls to .+ etcetera) (@ref man-dot-operators) into a single broadcast call.
ja: ネストされた「ドットコール」f.(...)(.+eteteraへの呼び出しを含む) (@ref man-dot-operators)は、単一のブロードキャスト・コールに対して使用されます。

source: Nested quote
ja: ネストされた引用符

source: Network I/O
ja: ネットワークI/O

source: Nevertheless, we have used multiple dispatch and methods almost continually without being aware of it: all of Julia's standard functions and operators, like the aforementioned + function, have many methods defining their behavior over various possible combinations of argument type and count.
ja: にもかかわらず、私たちは知らない間に、ほぼ断続的に多重ディスパッチとメソッドを使用してきました。 前述の+関数のような、Juliaの標準的な関数と演算子はすべて、多くのメソッドを持ち、引数の型と個数のさまざまな組み合わせに対して動作が定義されています。

source: No automatic casting or conversion of function arguments is ever performed: all conversion in Julia is non-magical and completely explicit.
ja: 関数の引数の自動キャストや変換は一度も実行されません。 Juliaでは、すべての変換は魔法ではなく完全に明示的です。

source: No matter how an AbstractArray{T,N} is represented internally, T is the type of object returned by integer indexing (A[1, ..., 1], when A is not empty) and N should be the length of the tuple returned by `size`.
ja: AbstractArray{T,N}が内部的にどのように表されても、Tは以下のタイプである。 整数インデックス(A[1,.…,1],)はAであり、Nはnである。 `size'によって返されるタプルの長さです。

source: No need to vectorize code for performance; devectorized code is fast
ja: 性能のためにコードをベクトル化する必要がありません。ベクトル化されていないコードも高速に動作します。

source: No, you are not allowed to have a using or import statement inside a function.
ja: いいえ、関数内の<x/>またはインポートステートメントをのインポートを使用することはできません。

source: Non-associative
ja: 非結合

source: Non-boolean integers
ja: 非ブール値の整数

source: Non-constant Function Specifications
ja: 非定常関数仕様

source: Non-traditional indices
ja: 非伝統的なインデックス

source: Not all integer values are valid Unicode code points, but for performance, the Char() conversion does not check that every character value is valid.
ja: 全ての整数値が有効なUnicodeコードポイントではありません。しかしパフォーマンスの為に、Juliaは Char() の呼び出しの際に 引数が有効なUnicodeコードポイントであるかをチェックしません。

source: Not all integer values are valid Unicode code points, but for performance, the Char conversion does not check that every character value is valid.
ja: 全ての整数値が、有効なUnicodeコードポイントではありません。しかしパフォーマンスのために、Char() への変換の際に、文字の値が、有効であるかどうかをチェックしません。

source: Not all types support axes and indexing, but many are convenient to allow in broadcast.
ja: すべてのタイプが軸とインデックス作成をサポートするわけではありませんが、ブロードキャストでは多くの場合に便利です。

source: Note that if the object was not originally allocated by Julia, the new object will never be finalized by Julia's garbage collector.
ja: 注 オブジェクトが元々ジュリアによって割り当てられていない場合、新しいオブジェクトは最終的にはファイナライズされません。 ジュリアのガーベジ・コレクターです。

source: Note also that UTF-8 string data in Julia is internally NUL-terminated, so it can be passed to C functions expecting NUL-terminated data without making a copy (but using the Cwstring type will cause an error to be thrown if the string itself contains NUL characters).
ja: また、JuliaのUTF-8文字列データは内部的に存在することにも注意してください。 NUE終端されているので、Nendは コピー(ただし、Cwstringタイプを使用すると、文字列自体にエラーが発生することがあります) NUL文字)。

source: Note how the size of the resulting array is different in the last two cases.
ja: 最後の2つのケースでは、結果として得られる配列のサイズが異なることに注意してください。

source: Note on Optional and keyword Arguments
ja: オプション引数とキーワード引数の注意点

source: Note that ARGS is also set when a Julia expression is given using the -e option on the command line (see the julia help output below) but PROGRAM_FILE will be empty.
ja: コマンドラインで -e オプションが設定された際にも ARGS は設定されます（下の julia ヘルプ出力を参照してください）が、PROGRAM_FILEは空です。

source: Note that 3/4im == 3/(4*im) == -(3/4*im), since a literal coefficient binds more tightly than division.
ja: 3/4im==3/(4*im)==-(3/4*im)は、リテラル係数がより強く結合するので、以下のようになることに注意してください。 分割。

source: Note that `DomainError` without parentheses is not an exception, but a type of exception.
ja: 括弧なしの'DomainErrorは例外ではなく、例外のタイプであることに注意してください。

source: Note that is_linux and is_apple are mutually exclusive subsets of is_unix.
ja: is_linuxおよびis_appleは、is_unixの相互排他的なサブセットであることに留意されたい。

source: Note that islinux and isapple are mutually exclusive subsets of isunix.
ja: アリヌスおよびイサプリは、イシュニクの相互排他的なサブセットであることに留意されたい。

source: Note that ARGS is also set when script code is given using the -e option on the command line (see the julia help output below) but PROGRAM_FILE
ja: コマンドラインで -e オプションが設定された際にも ARGS は設定されます（下の julia ヘルプ出力を参照してください）。

source: Note that Julia knows how to convert an array into a Ptr{Cdouble}, how to compute the size of a type in bytes (identical to C's sizeof operator), and so on.
ja: ジュリア 配列をPtr{Cdouble}に変換する方法を知っています。バイト単位でタイプのサイズを計算する方法 (Cのsizeof演算子と同じ)などです。

source: Note that comparisons such as == operate on whole arrays, giving a single boolean answer.
ja: ==のような比較は、すべての配列に対して動作し、単一のブール値を与えることに注意してください。 答えます。

source: Note that comparisons such as == operate on whole arrays, giving a single boolean answer. Use dot operators like .== for elementwise comparisons. (For comparison operations like <, only the elementwise .< version is applicable to arrays.)
ja: ==のような比較は、すべての配列に対して動作し、単一のブール値を与えることに注意してください。 答え:.==のようなドット演算子を使用して、要素ごとの比較を行います(比較のために)。 のような操作、は、配列に適用されます。)

source: Note that equivalent expressions may be constructed using `Meta.parse` or the direct Expr
ja: 等価な表現は、'Meta.parse'または直接Exprを用いて構成されることがあることに注意されたい。

source: Note that events may be coalesced, so multiple calls to uv_async_send may result in a single wakeup notification to the condition.
ja: イベントは合体することがあるので、uv_async_sendへの複数の呼び出しは単一のウェイクアップを引き起こす可能性があることに注意してください。 条件への通知。

source: Note that for this code to work correctly, result_array must be declared to be of type Ref{Cdouble}
ja: このコードが正しく動作するためには、の結果_arrayはRef{Cdouble}の型であることが宣言されている必要があることに注意してください。

source: Note that it's very important to specify the two parameters of the AbstractArray; the first defines the `eltype`, and the second defines the `ndims`.
ja: AbstractArrayの2つのパラメータを指定することが非常に重要であることに注意してください。最初のパラメータは次のようになります。 'エルテープを定義し、2番目は'ンダムス''を定義します。

source: Note that line breaks in literal strings, whether single- or triple-quoted, result in a newline (LF) character \n in the string, even if your editor uses a carriage return \r (CR) or CRLF combination to end lines.
ja: シングルクオートかトリプルクオートかどうかに関係なく、文字列リテラルの改行は、 たとえあなたのエディタがキャリッジリターン \r(CR) またはCRLFの組み合わせを行末に使っているとしても、文字列内の改行(LF)文字 \nになります。

source: Note that mathematical functions typically return real values when applied to real numbers and complex values when applied to complex numbers.
ja: 数学的関数は通常、実数を実数に適用すると実値を返すことに注意してください。 複素数に適用された場合の複雑な値。

source: Note that no C header files are used anywhere in the process of calling C functions: you are responsible for making sure that your Julia types and call signatures accurately reflect those in the C header file.
ja: Cの関数を呼び出すプロセスでは、Cヘッダー・ファイルは使用されないことに注意してください。 あなたのジュリア・タイプとコール・シグニチャーがCヘッダーにあるものを正確に反映していることを確認するために ファイルを参照してください。

source: Note that no C header files are used anywhere in the process of calling C functions: you are responsible for making sure that your Julia types and call signatures accurately reflect those in the C header file. (The Clang package can be used to auto-generate Julia code from a C header file.)
ja: Cの関数を呼び出すプロセスでは、Cヘッダー・ファイルは使用されないことに注意してください。 あなたのジュリア・タイプとコール・シグニチャーがCヘッダーにあるものを正確に反映していることを確認するために ファイル(Clangパッケージは自動生成のために使用できます。 Cヘッダー・ファイルからのJuliaコード。)

source: Note that no whitespace may come between a numeric literal coefficient and the identifier or parenthesized expression which it multiplies.
ja: 数値リテラル係数と乗算識別子や括弧で囲まれた式の間には、空白を入れることができませんので、注意してください。

source: Note that symbols such as :sin return precedence 0.
ja: :sinreturn precedence0のような記号があることに注意してください。

source: Note that the argument list can — and often does — include other nested Broadcasted wrappers.
ja: 引数は リストは、他のネストされたブロードキャストされたラッパーを含むことが多い。

source: Note that the argument type tuple must be written as (Cstring,), rather than (Cstring).
ja: 引数のタイプは、(Cstring)ではなく、(Cstring,)として記述する必要があることに注意してください。

source: Note that the argument type tuple must be written as (Cstring,), rather than (Cstring). This is because (Cstring) is just the expression Cstring surrounded by parentheses, rather than a 1-tuple containing Cstring:
ja: 引数のタイプは、(Cstring)ではなく(Cstring)として記述する必要があることに注意してください。 (Cstring)は、Cstringで囲まれた括弧で囲まれた表現であり Cstring:を含む1組のタプル

source: Note that the set of operations that should not be attempted in a generated function is unbounded, and the runtime system can currently only detect a subset of the invalid operations.
ja: 生成された関数で試行されるべきではない一連の操作は、制限されないことに注意してください。 ランタイム・システムは、現在、無効な操作のサブセットのみを検出できます。

source: Note that the spaces around ? and : are mandatory: an expression like a?b:c is not a valid ternary expression (but a newline is acceptable after both the ? and the :).
ja: ?と<X21/>:以外のスペースは必須です。式は次のようになります。 a?b:cは、有効な三元表現ではありません(ただし、?)は、?と :)。

source: Note that very short conditional statements (one-liners) are frequently expressed using Short-Circuit Evaluation in Julia, as outlined in the next section.
ja: 非常に短い条件文(oneliner)は、短絡を使用して頻繁に表現されることに注意してください。 次のセクションで概説されているように、Juliaでの評価。

source: Note that when using ccall with the tuple input (e.g., ccall((:my_fcn, "./my_lib.so"), ...)), the library is opened implicitly and it may not be explicitly closed.
ja: タプル入力でccallを使用するときに注意してください。 (例:ccall((:my_fcn,"./my_lib.so"),.))ライブラリは暗黙的にオープンされます。 明示的にクローズされることはありません。

source: Note the dot syntax is also applicable to user-defined operators.
ja: ドット構文は、ユーザ定義の演算子にも適用できます。

source: Note the evaluation behavior of chained comparisons:
ja: 連続した比較の値の処理に注意してください。

source: Note the important distinction between the way a and b are used:
ja: aとbとの間では、次のような重要な違いがあります。

source: Note though, that import X can load different packages in different contexts: X can refer to one package named X in the main project but potentially different packages named X in each dependency.
ja: ただし、インポートXは異なるコンテキストで異なるパッケージをロードできます。Xは主プロジェクトでXという名前のパッケージを参照できますが、各依存関係ではXという名前のパッケージがある可能性があります。

source: Note, though, that the above only defines `getindex` with one integer index.
ja: しかし、上記のは、1つの整数インデックスを有する'getindex'を定義することに注意されたい。

source: Note: This feature is currently implemented on 64-bit x86 and AArch64 platforms only.
ja: 注:この機能は現在、64ビットのx86およびAArch64プラットフォームでのみ実装されています。

source: Notice that :(1 + 2) now appears in the result instead of the symbol :x.
ja: :(1 + 2)は、シンボル:xではなく、結果に表示されることに注意してください。

source: Notice that the $ interpolation syntax allows inserting only a single expression into an enclosing expression.
ja: $x2/>補間構文では、1つの式のみを挿入できます。 式を囲みます。

source: Notice that the expressions str[k] and str[k:k] do not give the same result:
ja: str[k] と str[k:k]は同じ結果にならないことに留意してください。:

source: Notice that the result contains Expr(:$, :x), which means that x has not been evaluated yet.
ja: 結果がExpr(:$, :x)であることに注目してください。x4/>は、xのことを意味しません。 評価されました。

source: Notice that the result is a generic function, but with a compiler-generated name based on consecutive numbering.
ja: こうして生成されるのは総称関数ですが、コンパイラが順に番号付けした名前がつけられる点に注意しましょう。

source: Notice that this is an IndexCartesian array, so we must manually define `getindex` and `setindex!`
ja: これは、IndexCartesian配列であることに注意してください。

source: Notice that we have to be careful about the return type: qsort expects a function returning a C int, so we annotate the return type of the function to be sure it returns a Cint.
ja: 戻り値のタイプに注意する必要があることに注意してください。qsortqsortは関数を返すことに注意してください。 Cintであるため、関数の戻り値の型に注釈を付けて、Cintを返すことを確認します。

source: Notice that, after the function call, x is still bound to the same array, but the content of that array changed: the variables A and x were distinct bindings referring to the same mutable Array object.
ja: 次の点に注目してください。 関数呼び出しxは、まだ同じ配列にバインドされていますが、その配列の内容は変更されています。 変数Aおよびx14/>は、同じ可変の配列オブジェクトを参照する別個のバインディングである。

source: Now OrderedPair objects can only be constructed such that x <= y:
ja: OrderedPairオブジェクトは、x<=yのように構成できるようになりました。

source: Now things get interesting.
ja: これで面白いですね。

source: Now we add some new methods to f(x):
ja: ここでいくつかの新しいメソッドをf(x)に追加します。

source: Now, by default, broadcasted just calls the Broadcasted constructor to create the lazy representation of the fused expression tree, but you can choose to override it for a particular combination of function and arguments.
ja: さて デフォルトでは、ブロードキャストされたは、ブロードキャストされたコンストラクタを呼び出して、遅延表現を作成します。 融合された表現ツリーのうち、特定の組み合わせに対して上書きすることを選択できます。 関数と引数を指定します。

source: Now, consider a slightly more complex macro:
ja: ここでは、もう少し複雑なマクロを示します。

source: Now, suppose that we have a 1d array A of values in Julia that we want to sort using the qsort function (rather than Julia's built-in sort function).
ja: 次に、1d配列があると仮定します。これは、配列をソートするために、Juliaに値をAとします。 qsort関数を使用します(Julyの組み込み<X21/>ソート関数ではなく、関数を使用します)。

source: Now, when we ask Julia to `collect` all the elements into an array it can preallocate a Vector{Int}
ja: さて、ジュリアに「collect」<x×2/>の要素を「collect」に尋ねると、Vector{Int}をプリ割り当てすることができる。

source: Number of elements
ja: 要素の数

source: Numeric Comparisons
ja: 数値比較

source: Numeric literals also work as coefficients to parenthesized expressions:
ja: 数値リテラルは括弧内の式の係数としての役割も持ちます。:

source: Numerical Conversions
ja: 数値変換

source: OR
ja: または

source: Observe the following specific instances of these rules in our example:
ja: 次の例では、これらのルールの特定のインスタンスを観察します。

source: Occasionally, you have an array of expressions and need them all to become arguments of the surrounding expression.
ja: 時には、式の配列を持っていて、それをすべて引数にする必要があります。 で指定します。

source: Of course, in a purely linear function body like g, the usage of return is pointless since the expression x + y is never evaluated and we could simply make x * y the last expression in the function and omit the return.
ja: もちろん、gのように直線的に順次処理を行う関数で、return を使っても仕方がありません。 というのも、x + y という式は決して評価されないので、単に x * y という式で終わって、return を削ればいいからです。

source: Of course, messing around with an object's internals uninvited is bad practice.
ja: もちろん、オブジェクトの内部悪魔の招待状を回避することは、不適切なプラクティスです。

source: Of course, the real trouble comes when one asks what a character is.
ja: ここでいう記号とは一般的な意味のそれとは少し違います。 Ω

source: Of course, you can omit the dot if you write a specialized "vector" method of f, e.g. via f(A::AbstractArray) = map(f, A), and this is just as efficient as f.(A).
ja: もちろん、fの特殊な「ベクトル」方式を書く場合は、例えばf(A::AbstractArray)=map(f, A)を使ってドットを省略することができます。 これは、f.(A)と同じくらい効率的です。

source: Of particular interest may be An Interview with the Old Man of Floating-Point.
ja: 特に An Interview with the Old Man of Floating-Pointは特に興味深いものとなっています。

source: Often referred to as logical indexing or indexing with a logical mask, indexing by a boolean array selects elements at the indices where its values are true.
ja: 論理的なインデックス作成と呼ばれる論理的インデックス作成またはインデックス作成と呼ばれることが多いインデックス作成 ブール型配列では、値が真であるインデックスで要素を選択します。

source: Often referred to as logical indexing or indexing with a logical mask, indexing by a boolean array selects elements at the indices where its values are true. Indexing by a boolean vector B is effectively the same as indexing by the vector of integers that is returned by `findall(B)`. Similarly, indexing by a N-dimensional boolean array is effectively the same as indexing by the vector of CartesianIndex{N}s where its values are true. A logical index must be a vector of the same length as the dimension it indexes into, or it must be the only index provided and match the size and dimensionality of the array it indexes into. It is generally more efficient to use boolean arrays as indices directly instead of first calling `findall`.
ja: 論理的なインデックス作成と呼ばれる論理的インデックス作成またはインデックス作成と呼ばれることが多いインデックス作成 ブール型配列では、値が真であるインデックスで要素を選択します。 ブール型ベクトルBによるインデックス作成は、実効的には、以下のようにして行われる。 'findall(B)`によって返される整数のベクトル。同様に索引付け N-次元ブール配列は、実効的には、以下のように、インデックス化と同じである。 CartesianIndex{N}sのベクトル。その値は真である。論理インデックス は、インデックスを作成する寸法と同じ長さのベクトルである必要があります。また 指定された唯一のインデックスであり にインデックスを作成する配列です。一般的には、ブール型配列を使用する方が効率的です。 は、最初の呼び出し'findallを呼び出すのではなく、直接インデックスを作成します。

source: Often the best way to deal with these is to deal with the byte offsets directly.
ja: これらを処理する最良の方法は、バイトオフセットを直接処理することです。

source: Often, however, a ready-to-use, named function does not exist.
ja: ですが、多くの場合、すぐ使える名前付きの関数なんて存在しません。

source: On 32-bit architectures, `typeof(ans)` will be `Int32`.
ja: 32ビットのアーキテクチャ上では、 `typeof(ans)` は`Int32`.を返します。

source: On all systems we currently support, basic C/C++ value types may be translated to Julia types as follows.
ja: 現在サポートされているすべてのシステムでは、基本的なC/C++の値タイプがJuliaタイプに変換されることがあります。 以下のようになります。

source: On all systems we currently support, basic C/C++ value types may be translated to Julia types as follows. Every C type also has a corresponding Julia type with the same name, prefixed by C. This can help for writing portable code (and remembering that an int in C is not the same as an Int in Julia).
ja: 現在サポートされているすべてのシステムでは、基本的なC/C++の値タイプがJuliaタイプに変換されることがあります。 次のように、C型はすべて、同じ名前で接頭辞をつけられた同じ名前を持つ、対応するジュリア型を持っています。 これは、移植可能なコードを書くのに役立ちます(そして、Cではintが同じではないことを思い出してください)。 のIntIntint。

source: On the flip side, it is often handy to "splat" the values contained in an iterable collection into a function call as individual arguments.
ja: 逆に、iterableコレクションに含まれる値を"splat"するのは便利なことが多い。 関数呼び出しに個別の引数として指定します。

source: On the other hand, any type of expression can be used at the end of a conditional chain.
ja: 一方、条件式の連鎖の最終項では、あらゆる型の式が利用可能です。。

source: On the other hand, the symbol
ja: 一方、記号は

source: Once the user has entered a complete expression, such as 1 + 2, and hits enter, the interactive session evaluates the expression and shows its value.
ja: ユーザーが完全な式、例えば 1 + 2 を入力し、エンターキーを押すと、その式が評価され、値が表示されます。

source: Once created, they participate in arithmetic with all other numeric types thanks to Julia's (@ref conversion-and-promotion):
ja: Juliaの 型プロモーションと変換機構 (@ref conversion-and-promotion)により、一度生成すると、全ての数値型で演算に対応します。

source: Once this package is loaded, i.e. after its first import, any subsequent import resolving to the same uuid will simply create a new binding to the original already-loaded package module.
ja: このパッケージがロードされると、すなわち最初のインポート後、同じuuidへの後続のインポート解決は、元のすでにロードされているパッケージモジュールへの新しいバインドを作成します。

source: Once you understand how Julia works, it's easy to write code that's nearly as fast as C.
ja: Juliaがどのように動作するかを理解すれば、C言語と同等の速さで動くコードを簡単に書くことができるでしょう。

source: Once you understand how Julia works, it’s easy to write code that’s nearly as fast as C.
ja: Juliaがどのように動作するかを理解すれば、C言語と同等の速さで動くコードを簡単に書くことができるでしょう。

source: One can either restart Julia or use the Libdl functions to manage the library explicitly, such as:
ja: Juliaを再起動するか Libdlは、ライブラリを明示的に管理するために、次のような関数を実行します。

source: One common gotcha is that a 1-tuple must be written with a trailing comma.
ja: 一般的なゴチャの一つは、1タプルが必要であるということです。 後続のカンマで作成されます。

source: One consequence of federation is that there cannot be a central authority for package naming.
ja: フェデレーションの一つの結果は、パッケージ命名の中心的な権限を持つことができないということです。

source: One could declare it like this:
ja: それを宣言することができる こんな感じです

source: One of HasLength(), HasShape{N}(), IsInfinite(), or SizeUnknown() as appropriate
ja: HasLength()の一つ、HasShape{N}()、IsInfinite()、必要に応じて、SizeUnknown()

source: One of the most common and useful string operations is concatenation:
ja: 最も一般的で便利な文字列操作の一つが連結です。:

source: One rather important distinction between the previous while loop form and the for loop form is the scope during which the variable is visible.
ja: 前述のwhileループ方式とforループ方式のかなり重要な違いの1つは、ループの実行中の変数が見えるスコープです。

source: One way to do this is to provide a constructor only for SummedArray, but inside the struct definition block to suppress generation of default constructors:
ja: これを実現する一つの方法は SummedArrayのコンストラクタだけでなく、構造体定義ブロックの中にあるコンストラクタのみを抑制する デフォルト・コンストラクタの生成:

source: Operations on AbstractArray objects are defined using higher level operators and functions, in a way that is independent of the underlying storage.
ja: AbstractArrayオブジェクトに対する操作は、より高い値を使用して定義されます。 レベル演算子と関数は、基礎となる記憶域とは独立して存在します。

source: Operator
ja: 演算子

source: Operator Precedence
ja: 演算子の優先順位

source: Operator Precedence and Associativity
ja: 演算子の優先順位と結合度

source: Operators
ja: 演算子

source: Operators Are Functions
ja: 演算子は関数

source: Operators With Special Names
ja: 特殊な名前の演算子

source: Operators are just functions with special notation – to extend addition to new user-defined data types, you define new methods for the + function.
ja: これに対してJuliaの演算子は（特殊な記法を持った）単なる関数に過ぎません。 ユーザーが定義したデータ型に対して加算処理を追加したい場合は、+ 関数に対して新たなメソッドを定義します。

source: Operators are just functions with special notation — to extend addition to new user-defined data types, you define new methods for the + function.
ja: これに対してJuliaの演算子は（特殊な記法を持った）単なる関数に過ぎません。 ユーザーが定義したデータ型に対して加算処理を追加したい場合は、+ 関数に対して新たなメソッドを定義します。

source: Operators are just functions with special notation — to extend addition to new user-defined data types, you define new methods for the ``+`` function.
ja: これに対してJuliaの演算子は（特殊な記法を持った）単なる関数に過ぎません。 ユーザーが定義したデータ型に対して加算処理を追加したい場合は、``+`` 関数に対して新たなメソッドを定義します。

source: Operators like + are also valid identifiers, but are parsed specially.
ja: 例えば + のような演算子も変数名として有効な識別子ですが、異なった解析がされます。

source: Optional methods
ja: オプションのメソッド

source: Optionally, outer constructors that determine type parameters automatically can be added, for example constructing a Point{Int}
ja: オプションで、外部コンストラクタ たとえば、ポイント{Int}の構成など、タイプパラメータを自動的に追加することができます。

source: Optionally, with this form you can also specialize on the type of dest.
ja: オプションで、このフォームでは、destのタイプに特化することもできます。

source: Or you could put that code into a script and run it:
ja: あるいは、スクリプトにコードを挿入して実行することもできます。

source: Order-Related Functions
ja: 順序関連の関数

source: Other compositions of unary operators are parsed with right-associativity, e.
ja: 単項演算子の他の組成は、右の連想であるeで解析されます。

source: Other numeric types, such as integers or 32-bit floating-point values, are not automatically converted to 64-bit floating-point, nor are strings parsed as numbers.
ja: 他の整数や32ビット浮動小数点数などの数値型は、自動的に64ビット浮動小数点数に変換されず、文字列も数字として解析されません。

source: Other supported conventions are: stdcall, cdecl, fastcall, and thiscall (no-op on 64-bit Windows).
ja: その他のサポートされる規則は以下の通りです:stdcall,cdecl,fastcall,(64ビットWindows上でのno-op on64ビットWindows)。
